## 1.1 프로그래밍이란?

---

- 프로그래밍은 컴퓨터와의 커뮤니케이션이며 앞서 필요한 것은 아래와 같다.
    1. 요구사항 이해한다는 것은
        - 요구사항을 분해 → 정리 → 순서에 맞게 행위 배열하는 것이다.
    2. 문제 해결 방안 정의한다는 것은
        - 컴퓨터가 이해할 수 있도록 문제를 설명해야한다. 이때 필요한 것이 `컴퓨팅 사고`이다.
- 프로그래밍 내에서 사용될 모든 개념은 논리적으로 설명되어야 한다.
    - 평가 기준이 없는 것은 프로그래밍에서 유의미하지 않다.

## 1.2 프로그래밍 언어

---

- 우리는 컴퓨터에게 문제를 해결하기 위해 명령을 내려야한다. 그때 필요한 언어는 `기계어`이다.
- 기계어를 배워 컴퓨터에게 전달하기에는 어려운 일이기 때문에 우리는 `프로그래밍 언어`를 사용한다.
    - 이는 사람이 이해할 수 있게 약속된 문법의 형태의 인공언어이며
        
        `Syntax(문법)` 와  `Semantics(의미)`의 조합이다.
        
- 프로그래밍 언어를 사용해 프로그램 작성 후 컴퓨터가 이해할 수 있는 기계어로 번역하는 일을 하는 `컴파일러` 또는 `인터프리터`가 한다.
    - 사람 ↔ 프로그래밍 언어 ↔ 컴파일러/인터프리터 ↔ 기계어 ↔ 컴퓨터

## 1.3 구문과 의미

---

- 언어의 문법을 안다고해서 해당 언어를 잘 하는 것은 아니다.
- 언어를 사용해 올바른 의미를 담아 문법에 맞게 문장을 작성해야 한다.
- 또한 작성한 문장을 통해 요구사항이 실현(문제가 해결)되어야 유의미하다.
- 프로그래밍의 목적은 문제를 해결하는 것이고,
- 즉, 요구사항의 집합을 분석해 적절한 자료구조와 함수의 집합으로 변환 후, 그 흐름을 제어하는 것이다.